{
    "directions": [
        "12 hours before you plan to cook the dish, soak the beans: In a large pot, cover the beans with several inches of cold water and refrigerate overnight.", 
        "The following day, drain the beans, discarding the soaking liquid. Rinse well and return the beans to the large pot. Cover them with an inch of fresh water, set over medium-high heat, and bring to the boil. Boil until a cap of foam forms over the beans, about 15 minutes, then drain the beans through a colander and rinse again. Return the beans to the pot, cover them with another inch of fresh water, and set over medium-high heat. Bring to a low boil and cook, skimming off any foam that appears, for 45 minutes. Add the ground marigold, kondari or thyme, cayenne, half of the chopped cilantro, and half of the onions. Continue cooking, stirring occasionally, until the beans are tender, 45–50 minutes, adding more water as necessary to keep the beans covered by an inch of liquid.", 
        "Meanwhile, in a small skillet, melt the butter over medium heat. As the foam begins to subside, add the remaining onion and cook, stirring occasionally, until they are softened and light golden, 12–15 minutes. Remove from the heat and set aside.", 
        "In a mortar and pestle or a food processor, pound or pulse together the whole marigold petals and the coriander seed. Add the garlic and pound or pulse to break up the garlic. Add the parsley, celery leaf, and remaining remaining cilantro, pounding or pulsing until the mixture is a coarse paste. Pound or pulse in the ground walnuts, fenugreek, and salt until well-combined and set aside.", 
        "When the beans are tender, reduce to medium-low heat and stir the paste into the pot. Add the sautéed onions and the sour plum sauce or lemon juice and cook, stirring frequently, 10 minutes more. Taste for seasoning, divide into serving bowls, garnish with marigold leaves (if using) and serve immediately, either hot or at room temperature."
    ], 
    "ingredients": [
        "2 cups (12 oz.) dried Borlotti, cranberry, pinto, or other fine-skinned beans", 
        "1 tsp. ground marigold petals", 
        "1⁄2 tsp. dried kondari (summer savory) or  ¼ tsp. thyme", 
        "1⁄4 tsp. cayenne pepper", 
        "3⁄4 cup cilantro, finely chopped, divided", 
        "1 1⁄2 cups onion, finely chopped, divided", 
        "2 tbsp. unsalted butter", 
        "1 tbsp. dried whole marigold petals", 
        "1⁄2 tsp. coriander seed", 
        "3 whole garlic cloves (½ oz.)", 
        "2 tbsp. Italian parsley, finely chopped", 
        "2 tbsp. finely chopped celery leaves", 
        "1 cup (4 oz) ground walnuts", 
        "1⁄2 tsp. ground fenugreek", 
        "2 tsp. salt", 
        "3 tbsp. Georgian sour plum sauce (tkemali) or lemon juice", 
        "French marigold leaves, to garnish (optional)"
    ], 
    "language": "en-US", 
    "source": "www.saveur.com", 
    "tags": [
        "Beans", 
        "walnuts", 
        "Georgia", 
        "Stew", 
        "spices"
    ], 
    "title": "Beans with Walnuts and Spices", 
    "url": "https://www.saveur.com/beans-with-walnuts-and-spices-recipe"
}