{
    "directions": [
        "Press the tofu: Set a large plate or cutting board in a large baking dish to catch excess liquid. Set the tofu on the plate, then place a second, similarly-sized plate or board on top of the tofu. Press by placing about 10 pounds of weight on top–the tofu should flatten out only slightly, not be completely crushed–a heavy pot or two 5-pound bags of flour work well. Set aside for at least 2 hours or overnight.", 
        "Process and season the tofu: transfer the pressed tofu to a large bowl and, using a food mill or potato masher, crush the tofu until it is a consistent, smooth paste. Add the scallions, mushroom bouillon, corn, and white pepper and mix until well-combined.", 
        "Make the tofu balls: Divide the mixture into tablespoons and roll into tightly-packed balls by cupping your hands and gently moving them in an alternating clockwise motion to smooth out any cracks. Place the tofu balls on a plate or a baking sheet and set in the refrigerator, uncovered, while you make the spicy aioli and the flour paste.", 
        "In a small bowl, combine the mayo or aioli and Sriracha, then set aside.", 
        "In a medium bowl, combine the flour, 1¼ cup water, and mushroom bouillon. Stir well with a fork until no lumps remain. In a separate medium bowl, combine the rice flakes and half of the dry cornstarch. Remove the balls from the fridge. Drop them, one at a time, in the flour paste. Using a kitchen “spider” strainer, a slotted spoon, or one hand, lift the balls from the paste and shake off any excess paste before dropping them in the rice flake mixture. Use your dry hand to roll the balls in the flakes to fully coat. Gently clench the balls to pack adhere as many flakes as possible. When the flakes begin fall off the balls, mix in the remaining cornstarch to dry the mixture and keep going. Set the balls back on the baking sheet while you get ready to fry.", 
        "Cover a large plate with a few layers of clean paper towels and set it by the stove. In a heavy bottomed pot, add 2 inches of oil and set over high heat. Set a deep-fry thermometer in the oil and bring to 350°F. Fry the balls in batches until the flakes puff up bright green and any exposed tofu turns a slight golden color, 3–4 minutes. Use a spider strainer or a slotted spoon to remove the balls from the oil, and transfer to the paper towels to drain while you continue frying. Transfer the balls to a serving plate, drizzle with some of the spicy aioli and serve immediately with more spicy aioli on the side for dipping."
    ], 
    "ingredients": [
        "1  (19-ounce) package firm tofu", 
        "1⁄3 cup finely chopped scallions", 
        "1 tbsp. plus 2¼ tsp. mushroom bouillon powder", 
        "1⁄4 cup fresh corn, cut from the cob", 
        "1⁄4 tsp. Finely ground white pepper", 
        "1⁄2 cup mayonaise or homemade aioli", 
        "1 tbsp. Sriracha", 
        "1 cup all-purpose flour", 
        "2 1⁄4 tsp. mushroom bouillon", 
        "1  12-oz. package green glutinous rice flakes (com dep xanh)", 
        "1⁄2 cup cornstarch", 
        "Canola oil for frying"
    ], 
    "language": "en-US", 
    "source": "www.saveur.com", 
    "tags": [
        "Tofu", 
        "scallions"
    ], 
    "title": "Crispy Tofu Balls", 
    "url": "https://www.saveur.com/crispy-tofu-balls-recipe"
}