{
    "directions": [
        "Combine the walnuts, garlic, coriander seed, fenugreek, 1 teaspoon salt, cilantro, basil, mint, dill, chilli (if using), ¼ cup of water in the bowl of a food processor and pulse until you have an even, spreadable paste. If the mixture seems too dry, thin with up to 3 additional tablespoons of water.", 
        "Sprinkle each eggplant slice with a little salt on both sides and place in a large bowl for 30 minutes to draw out some of the water. Drain the slices in a colander and rinse well under cold running water. Squeeze each slice carefully to remove excess liquid, then pat dry with paper towels.", 
        "Line a baking sheet with several layers of dry paper towels and set by the stove. In a large, deep skillet, add enough oil to come up ½ inch and set over medium-high heat. When the oil is hot (350°F on a deep-fry thermometer), add a single layer of eggplant slices to the pan. Don’t crowd them or the oil temperature will drop and the eggplant will become greasy. Fry until golden, 3–4 minutes per side, then use tongs or a slotted metal spoon to transfer them  to the lined baking sheet. Continue frying the rest of the slices in batches.", 
        "When the eggplant is cool enough to handle, spread a tablespoon of the walnut paste onto each slice, then roll them up up and transfer to a serving platter. Sprinkle with pomegranate seeds, fresh herbs, and additional salt if you like."
    ], 
    "ingredients": [
        "1 1⁄2 cups (7 oz.) walnuts", 
        "2-3  small garlic cloves (¼ oz.)", 
        "1⁄2 tsp. coriander seeds", 
        "1⁄4 tsp. ground fenugreek", 
        "1-1 1⁄2 tsp. plus 2 Tbsp. kosher salt, divided", 
        "3 tbsp. cilantro, roughly chopped", 
        "3 tbsp. fresh basil, roughly chopped", 
        "1 tbsp. fresh mint, roughly chopped", 
        "1 tsp. fresh dill, roughly chopped", 
        "1 tbsp. medium-hot red chili pepper, such as Fresno, finely chopped (optional)", 
        "6-7  small or 3–4 medium eggplants (about 1¼ lb.), stemmed and cut lengthwise into ½-inch slices", 
        "Canola or vegetable oil for frying", 
        "2 tbsp. pomegranate seeds and/or additional chopped herbs for topping"
    ], 
    "language": "en-US", 
    "source": "www.saveur.com", 
    "tags": [
        "Eggplants", 
        "Georgia"
    ], 
    "title": "Eggplant Rolls (Nigvziani", 
    "url": "https://www.saveur.com/eggplant-rolls-recipe"
}