{
    "directions": [
        "Preheat oven to 400°F. Mix butter, herbs, 1 tsp. salt, and 1/2 tsp. pepper in a small bowl.", 
        "Fold parchment sheets in half and use scissors to cut halves into 4 large hearts. Unfold and place parchment hearts open on a work surface. Spoon 1 Tbsp. herb butter in the center of one half of each heart, then divide snap peas, tomatoes, and garlic evenly into small piles over butter. Lay fish over vegetables, then top with 1 Tbsp. herb butter; season each with 1/8 tsp. salt and a pinch of pepper. Fold parchment over and crimp edges tightly to form a sealed packet.", 
        "Transfer packets to 2 large rimmed baking sheets, arranging in a single layer. Bake until just cooked through and a tester inserted through parchment slides through fish easily, about 13 minutes. Carefully cut open packets (steam will escape). Top with basil.", 
        "Butter can be made 3 days ahead; cover and chill. Fish packets can be assembled 4 hours ahead; chill. Let sit at room temperature 15 minutes before cooking."
    ], 
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter, room temperature", 
        "2 tablespoons finely chopped tender herbs (such as cilantro, chives, and/or parsley)", 
        "1 1/2 teaspoons kosher salt, divided", 
        "1/2 teaspoon freshly ground black pepper, plus more", 
        "1 pound sugar snap peas, trimmed", 
        "1 pint cherry tomatoes (about 2 1/2 cups), quartered", 
        "2 large garlic cloves, thinly sliced", 
        "4 (1/2\"-thick) skinless flounder or tilapia fillets (about 6 ounces each)", 
        "1/4 cup coarsely chopped basil", 
        "4 (16x12\") sheets parchment paper"
    ], 
    "language": "en-US", 
    "source": "www.epicurious.com", 
    "tags": [
        "Back to School", 
        "Fish", 
        "Seafood", 
        "Kid-Friendly", 
        "Sugar Snap Pea", 
        "Tomato", 
        "Dinner", 
        "Wheat/Gluten-Free", 
        "Pescatarian", 
        "Small Plates"
    ], 
    "title": "Fish Packets with Snap Peas, Tomatoes, and Herb Butter", 
    "url": "https://www.epicurious.com/recipes/food/views/fish-packets-with-snap-peas-tomatoes-and-herb-butter"
}