{
    "directions": [
        "Create an herb bundle (bouquet garni): Place the thyme sprigs, celery, and bay leaf in a neat pile, then secure them together by wrapping tightly crosswise with a piece of twine. Set aside.", 
        "In a large pot, add the ventrèche, beans, potatoes, sliced garlic, carrots, leeks, onion, turnip, cabbage, the bouquet garni, a tablespoon of kosher salt, and the peppercorns. Add 2 quarts of fresh water, cover the pot, and bring the liquid to a boil over high heat. Once boiling, lower the heat to maintain a simmer, cover, and continue to cook until the vegetables are tender and the beans are nearly tender, 50–60 minutes. Take the duck legs by the ankle and use them to stir the pot a few times before dropping them into the soup. Continue cooking until the beans are tender and the duck meat easily falls off the bone when poked with a fork, 25–30 minutes. Let the glossy skin slip off into the soup, then remove and discard the bones, and break the meat into smaller pieces.", 
        "When ready to serve, prepare the garnish: In a medium skillet, warm the duck fat over medium heat. Add the Jambon de Bayonne in batches and cook in a single layer, turning once, until lightly browned and crispy, about 4 minutes per side.", 
        "Rub each slice of bread with one of the garlic halves and distribute the slices between 6 wide, shallow soup bowls. Ladle the soup over the bread. Drape a slice of griddled ham atop each bowl and serve immediately."
    ], 
    "ingredients": [
        "5-6  fresh thyme sprigs", 
        "1  6-inch piece celery stalk with leaves, or a few sprigs lovage or flat-leaf parsley", 
        "1  large bay leaf", 
        "8 oz. ventrèche (unsmoked French pancetta), salt pork, or fresh pork belly, chopped into bite-size strips", 
        "4 oz. dried white beans such as white runner or great northern, soaked overnight and drained", 
        "4  medium Yukon Gold potatoes (1 lb. 8 oz.), peeled and quartered", 
        "4  garlic cloves, sliced, plus 3 more, halved lengthwise", 
        "3  large or 4 small winter carrots (about 7 oz.), peeled and cut into large chunks", 
        "2  large leeks (about 6 oz.), washed well and cut into 2- to 3-inch pieces", 
        "2  yellow onions (about 1 lb.), coarsely chopped", 
        "2  large or 6 small turnips (about 1 lb.), peeled and quartered", 
        "1  small Savoy cabbage (1½ lb.), cut into 6 thick wedges", 
        "1 tbsp. kosher salt, plus more to taste", 
        "12  whole black peppercorns", 
        "2  legs duck confit, wiped clean of most of their fat, plus 1 Tbsp. duck fat reserved from the confit", 
        "6  thin slices Jambon de Bayonne or prosciutto", 
        "6  thick slices crusty country bread, lightly toasted"
    ], 
    "language": "en-US", 
    "source": "www.saveur.com", 
    "tags": [
        "French", 
        "Duck", 
        "Soups"
    ], 
    "title": "Hearty Vegetable Stew with Duck Confit and Cabbage (Garbure Gasconne)", 
    "url": "https://www.saveur.com/hearty-vegetable-stew-duck-confit-cabbage-recipe"
}