{
    "directions": [
        "The night before you want to serve the waffles, combine the flour, sugar, yeast, and salt in a large bowl. Stir in the milk, then the melted butter and the vanilla if you’re using it, until just combined. Cover with plastic wrap and set aside overnight at room temperature. (Of course you can do this in the morning if you want waffles for supper.)", 
        "When you’re ready to bake, brush the waffle iron lightly with oil and heat it. Stir the egg yolks into the batter. Beat the whites until they hold soft peaks, then fold them gently into the batter until it’s relatively smooth.", 
        "Spread a ladleful or so of batter onto the waffle iron and bake until the waffle is done, usually 3 to 5 minutes, depending on your iron. Serve immediately or keep warm for a few minutes in a 200°F oven. If you’re making them ahead, store at room temperature in an airtight container and warm them in a 300°F oven for about 5 minutes just before serving; or freeze them in single layers, separated by sheets of parchment, and reheat in a 350°F oven for 8 to 10 minutes.", 
        "Whole Grain Overnight Waffles:\nReplace some or all of the all-purpose flour with any whole grain flour (whole wheat, oat, quinoa, kamut, or fine cornmeal, for instance) or combination of flours."
    ], 
    "ingredients": [
        "2 cups flour", 
        "1 tablespoon sugar", 
        "2 teaspoons instant yeast", 
        "1/2 teaspoon salt", 
        "1 1/2 cups milk, lukewarm", 
        "1 stick butter, melted and cooled", 
        "1/2 teaspoon vanilla extract (optional)", 
        "Neutral oil (like grapeseed or corn) for cooking", 
        "2 eggs, separated"
    ], 
    "language": "en-US", 
    "source": "www.epicurious.com", 
    "tags": [
        "Waffle", 
        "Breakfast", 
        "Brunch", 
        "Pastry"
    ], 
    "title": "Overnight Waffles", 
    "url": "https://www.epicurious.com/recipes/food/views/overnight-waffles"
}