{
    "directions": [
        "In the bowl of a stand mixer fitted with the dough hook, whisk the yeast, 2 cups cold water, and 1 tablespoon plus 1 ½ teaspoons olive oil.", 
        "In a medium bowl, whisk together the flour and salt. Slowly add the flour mixture to the yeast mixture, beating on the lowest setting until a dough forms and becomes elastic and smooth, about 5 minutes. Mix in 1 tablespoon of oil, then turn off the mixer.", 
        "Grease a large bowl lightly with olive oil, and transfer the dough to the bowl. Drizzle a little oil over the dough, spreading it to coat. Cover the bowl tightly with plastic wrap and set aside in a warm spot until the dough has doubled in size, about 90 minutes.", 
        "Preheat the oven to 375°. Using the palms of your hands, or a rolling pin to help if necessary, stretch and spread the dough out onto a clean work surface into an even rectangle, about 14x16 inches in size. Position it with a long side facing you, then layer the garlic, mozzarella, salami, and basil across the bottom ¾ of the dough, leaving the top quarter of the dough empty. Roll the bottommost quarter of dough over some of the filling, then repeat twice until all of the filling is enclosed; pull the empty flap of dough over the rest. Press to seal the dough and enclose the filling on all sides.", 
        "Line a clean baking sheet with parchment paper. Scatter the tomatoes around the top of the stromboli and press them gently into the dough. Sprinkle the rosemary and sea salt over the top of the dough and transfer to the oven. Bake for 20 minutes, then rotate the pan in the oven and repeat. Flip the stromboli on the baking sheet and bake for 5 minutes more. Remove from the oven and let cool slightly before slicing and serving."
    ], 
    "ingredients": [
        "1 tbsp. instant dry yeast", 
        "2 tbsp. plus 1 ½ tsp. extra-virgin olive oil, divided, plus more for greasing", 
        "5 1⁄2 cups bread flour", 
        "2 tsp. kosher salt", 
        "1 tbsp. garlic, chopped", 
        "2 cups shredded smoked or regular mozzarella (not in water)", 
        "4 oz. salami, thinly sliced", 
        "1⁄4 cup chopped basil leaves", 
        "1⁄4 pint cherry tomatoes", 
        "1 tbsp. rosemary, chopped", 
        "1 tsp. flaky sea salt"
    ], 
    "language": "en-US", 
    "source": "www.saveur.com", 
    "tags": [
        "Italian", 
        "italian-american", 
        "pizza", 
        "bread", 
        "Cheese", 
        "Appetizers"
    ], 
    "title": "Salami, Smoked Mozzarella, and Basil Stromboli", 
    "url": "https://www.saveur.com/salami-smoked-mozzarella-stromboli-recipe"
}