{
    "directions": [
        "Fill a large bowl ⅔ of the way with hot tap water and set it by the stove. In a small saucepan, combine the sugar and ¼ cup water. Stir to thoroughly moisten the sugar, then set it over medium-low heat. Cook until the mixture boils vigorously, then turns a dark black caramel color, 12-15 minutes. Remove from heat and immediately and carefully dip the bottom of the pan in the hot water bath to stop the cooking process. Return the pan to the stove, add an additional ½ cup of water to the caramel mixture, and return to medium heat, stirring until the caramel dissolves in the water. Once the caramel mixture is thoroughly combined, turn off the heat and set aside to cool.", 
        "In a large pan or wok, heat the oil over medium heat until it shimmers. Add the shallots and chilis and cook, stirring constantly, until very fragrant, about 2 minutes. Use a slotted spoon to remove the aromatics from the oil and transfer to a medium bowl.", 
        "Increase the heat to medium-high, then add the pork belly pieces in a single layer, without crowding the pan.  Sear on all sides to lightly brown, 12-15 minutes. Transfer the meat to the medium bowl and pour off and discard any excess oil and fat from the pan. Return the meat and aromatics to the pan, then add the fish sauce, 2 tablespoons of caramel sauce, and the Coco Rico soda, saving the remaining caramel sauce for another use. Stir well and bring to a boil over high heat. Once the mixture boils, lower the heat to maintain a simmer, partially cover, and cook, stirring occasionally, until the meat is tender and the juices are slightly thickened, about 2 hours.", 
        "When the meat is very tender, remove the pan from the from heat and add the peeled soft-boiled eggs, stirring gently to coat each egg with the sauce. Rest for 10 minutes to lightly stain the eggs, garnish with scallions, and serve with steamed white rice."
    ], 
    "ingredients": [
        "1 cup sugar", 
        "2 tbsp. canola oil", 
        "2 tbsp. minced shallots", 
        "3 whole Thai chilis, finely chopped", 
        "1 1⁄2 lb. pork belly, cut into 1-inch cubes", 
        "2 tbsp. fish sauce", 
        "1 3⁄4 cups Coco Rico soda", 
        "6  soft-boiled eggs", 
        "Scallions, finely chopped, for garnish", 
        "Steamed white rice, to serve"
    ], 
    "language": "en-US", 
    "source": "www.saveur.com", 
    "tags": [
        "Pork", 
        "Vietnamese", 
        "Braise"
    ], 
    "title": "Braised and Caramelized Vietnamese Coco Pork Belly (Thit Kho)", 
    "url": "https://www.saveur.com/braised-caramelized-vietnamese-coco-pork-belly-thit-kho-recipe"
}