{
    "directions": [
        "Heat a griddle or large skillet over medium-low heat while you make the batter.", 
        "Mix together the dry ingredients. Beat the eggs into 1 1/2 cups of the milk, then stir in the 2 tablespoons cooled melted butter if you’re using it. Gently stir this mixture into the dry ingredients, mixing only enough to moisten the flour; don’t worry about a few lumps. If the batter seems thick, add a little more milk.", 
        "Use a little butter or oil each time you add batter, unless your skillet is truly nonstick. When the butter foam subsides or the oil shimmers, ladle batter onto the griddle or skillet, making any size pancakes you like. Adjust the heat as necessary; usually, the first batch will require higher heat than subsequent batches. The idea is to brown the bottom in 2 to 4 minutes, without burning it. Flip when bubbles appear in the center of the pan-cakes and the bottoms are cooked; they won’t hold together well until they’re ready.", 
        "Cook until the second side is lightly browned, a couple more minutes, and serve or hold on an oven-proof plate in a 200°F oven for up to 15 minutes.", 
        "Sourdough Pancakes: This requires a sourdough starter, but if you have one this is a good place to take advantage of your foresight. Substitute 1 cup sourdough starter for half the flour; reduce the milk and salt by half, the baking powder to 1/2 teaspoon, and the egg to 1. Mix the starter, flour, and 1/2 cup of the milk to a medium-thin batter; let sit for an hour. Just before cooking, stir in the salt, sugar, and baking powder; then beat in the egg."
    ], 
    "ingredients": [
        "2 cups all-purpose flour", 
        "2 teaspoons baking powder", 
        "1/2 teaspoon salt", 
        "1 tablespoon sugar (optional)", 
        "2 eggs", 
        "1 1/2 to 2 cups milk", 
        "2 optional tablespoons melted and cooled butter, plus unmelted butter for cooking, or use a neutral oil like grapeseed or corn"
    ], 
    "language": "en-US", 
    "source": "www.epicurious.com", 
    "tags": [
        "Pancake", 
        "Breakfast", 
        "Brunch", 
        "Quick & Easy", 
        "Vegetarian"
    ], 
    "title": "Everyday Pancakes", 
    "url": "https://www.epicurious.com/recipes/food/views/everyday-pancakes"
}