{
    "directions": [
        "Cook cilantro in a medium pot of boiling salted water until wilted, about 20 seconds. Drain and transfer cilantro to a bowl of ice water. Swish around in water to cool. Drain, then squeeze excess liquid from herbs with your hands.", 
        "Purée cilantro, ginger, and 2 Tbsp. water in a blender until almost smooth. With motor running, gradually stream in oil and blend until smooth. Strain cilantro oil through a fine-mesh sieve into a small bowl; discard any solids. Mix lime juice into oil and season with salt.", 
        "Cilantro oil (without lime juice and salt) can be made 1 day ahead. Cover and chill. Bring to room temperature before adding lime juice and salt.", 
        "Process panko in a food processor until very finely ground (it will only take 45–60 seconds). Transfer to a shallow bowl. Place egg yolks in another shallow bowl and whisk in buttermilk. Place cornstarch in a third shallow bowl. Line a rimmed baking sheet with paper towels and set a wire rack inside.", 
        "Working with 1 fillet at a time, season with kosher salt on both sides and dredge in cornstarch, shaking off excess. Dip in egg mixture, letting excess drip back into bowl, then coat in panko, pressing to adhere before shaking off excess. Repeat steps to make a second coating. Place on a rimmed baking sheet. Repeat with remaining fillets.", 
        "Pour oil into a large heavy skillet, preferably cast iron, to come 1\" up sides. Heat oil over medium-high until an instant-read thermometer registers 350°F–365°F (Don’t let the tip of the thermometer touch the bottom of the skillet). Carefully lower a fillet along the side of skillet closest to you and let slide away from you into oil. Carefully swirl oil in skillet and cook fish just until golden on the bottom, about 2 minutes. Using a fish spatula or slotted spoon, carefully turn fish over and cook until golden on the other side, about 2 minutes. Transfer fish to wire rack in prepared baking sheet and season with sea salt while still hot. Repeat with remaining fillets.", 
        "Toss cucumbers, fennel, onion, chile, cilantro oil, and a pinch of kosher salt in a medium bowl and top with some cilantro.", 
        "Serve fish with cucumber ceviche and lime wedges."
    ], 
    "ingredients": [
        "4 cups cilantro", 
        "1 1-inch piece ginger, peeled, finely grated", 
        "1/2 cup neutral oil (such as sunflower or canola)", 
        "3 tablespoons fresh lime juice", 
        "4 cups panko (Japanese breadcrumbs)", 
        "4 large egg yolks", 
        "2 cups buttermilk", 
        "1 cup cornstarch", 
        "4 skinless, boneless gray sole or flounder fillets (about 1 1/2 pounds total)", 
        "3 medium Persian cucumbers, cut into small pieces", 
        "1 medium fennel bulb, cut into small pieces", 
        "1/2 small red onion, very thinly sliced", 
        "1/2 serrano chile, thinly sliced"
    ], 
    "language": "en-US", 
    "source": "www.epicurious.com", 
    "tags": [
        "Fish", 
        "Lime Juice", 
        "Breadcrumbs", 
        "Cilantro", 
        "Ginger", 
        "Cucumber", 
        "Fennel", 
        "Onion", 
        "Chile Pepper", 
        "Dinner", 
        "Fry"
    ], 
    "title": "Fish Milanese with Cucumber Ceviche", 
    "url": "https://www.epicurious.com/recipes/food/views/fish-milanese-with-cucumber-ceviche"
}