{
    "directions": [
        "Combine lemon and lime juice, hot sauce, olive oil, oregano, and salt in a large bowl. Add onion, jalapeño, and poblano chile and toss to combine. Let marinate at least 30 minutes and up to 1 hour while you prepare the rest of the dish.", 
        "Combine cornichons, mayonnaise, parsley, capers, tomato powder (if using), vinegar, chili powder, and salt in a small bowl.", 
        "Whisk flour, cornstarch, oregano, onion powder, tomato powder (if using), garlic powder, and 3 tsp. salt in a large bowl. Add club soda and quickly whisk to incorporate.", 
        "Pour canola oil into a large skillet to a depth of 1/4\". Heat oil over medium-high until shimmering, hot, and an instant-read thermometer registers 350°F. Dip fish into batter to coat, shake off excess, then fry until golden, crispy, and cooked through, about 4 minutes per side. Work in batches if necessary and adjust the heat as needed to keep oil at 350°F. Transfer to paper towels and season with salt.", 
        "Strain the slaw and discard liquid. Transfer slaw to a medium bowl.", 
        "Spread 1 Tbsp. tartar sauce on both sides of each bun and place tomato slices on bottom halves. Divide fried fish and slaw among sandwiches and add top halves of buns.", 
        "Slaw can be made, strained, and refrigerated up to 1 day ahead. Tartar sauce can be made and refrigerated up to 2 days ahead."
    ], 
    "ingredients": [
        "1 tablespoon plus 1 1/2 teaspoons fresh lemon juice", 
        "1 tablespoon plus 1 1/2 teaspoons fresh lime juice", 
        "1 tablespoon hot sauce", 
        "1 tablespoon olive oil", 
        "1/2 teaspoon dried oregano", 
        "1/2 teaspoon kosher salt", 
        "1/2 medium white onion, thinly sliced", 
        "1 large jalapeño, thinly sliced, seeds removed", 
        "1/2 medium poblano chile, thinly sliced, seeds removed", 
        "6–7 cornichons, thinly sliced into 1/4\" coins", 
        "1/2 cup mayonnaise", 
        "1/4 cup coarsely chopped fresh parsley", 
        "3 teaspoons coarsely chopped capers", 
        "2 teaspoons tomato powder (optional)", 
        "1 1/2 teaspoons distilled white vinegar", 
        "Large pinch chili powder", 
        "Large pinch kosher salt", 
        "1 cup all-purpose flour", 
        "1 cup cornstarch", 
        "3 teaspoons dried oregano", 
        "2 teaspoons onion powder", 
        "2 teaspoons tomato powder (optional)", 
        "1 teaspoon garlic powder", 
        "3 teaspoons kosher salt, plus more", 
        "1 1/2 cups club soda", 
        "Canola oil (for frying)", 
        "4 (4 1/2-ounce) skinless black bass fillets", 
        "4 sesame seed potato buns, split, toasted", 
        "8 slices ripe tomato"
    ], 
    "language": "en-US", 
    "source": "www.epicurious.com", 
    "tags": [], 
    "title": "Fried Fish Sandwich with Pepper Slaw", 
    "url": "https://www.epicurious.com/recipes/food/views/fried-fish-sandwich-with-pepper-slaw-56389577"
}